Did you remember to run the `sql_variables.sh script` before opening up jupyter notebook?  `. ~/Desktop/sql_variables.sh`

In [1]:
import pymysql
import pandas as pd
import os

In [2]:
conn = pymysql.connect(host=os.environ.get('SQLHOSTID'),
                      port=3306,
                      user=os.environ.get('SQLUSERID'),
                      passwd = os.environ.get('SQLPASSWORD'),
                      db='financial')

In [7]:
loan_df = pd.read_sql("SELECT * FROM loan l \
                 INNER JOIN account a \
                 ON l.account_id = a. account_id \
                 JOIN district d on a.district_id = d.district_id \
                 ORDER BY l.account_id", conn)

In [8]:
loan_df.head()

,loan_id,account_id,date,amount,duration,payments,status,account_id,district_id,frequency,...,A7,A8,A9,A10,A11,A12,A13,A14,A15,A16
0,4959,2,1994-01-05,80952,24,3373.0,A,2,1,POPLATEK MESICNE,...,0,1,1,100.0,12541,0.2,0.43,167,85677.0,99107
1,4961,19,1996-04-29,30276,12,2523.0,B,19,21,POPLATEK MESICNE,...,7,1,7,67.0,9104,1.5,2.07,123,2299.0,2354
2,4962,25,1997-12-08,30276,12,2523.0,A,25,68,POPLATEK MESICNE,...,18,2,6,57.2,9893,4.0,4.72,96,5623.0,5887
3,4967,37,1998-10-14,318480,60,5308.0,D,37,20,POPLATEK MESICNE,...,3,1,4,58.4,8547,2.6,3.64,120,1563.0,1542
4,4968,38,1998-04-19,110736,48,2307.0,C,38,19,POPLATEK TYDNE,...,3,1,4,52.7,8402,3.1,3.98,120,999.0,1099

In [9]:
#Close the connection after you get what you want
conn.close()

In [10]:
#Writing to csv
loan_df.to_csv('data/loan.csv', index=False)

In [11]:
#Check that we can read this back into the notebook
df_check = pd.read_csv('data/loan.csv')
df_check.head()

,loan_id,account_id,date,amount,duration,payments,status,account_id.1,district_id,frequency,...,A7,A8,A9,A10,A11,A12,A13,A14,A15,A16
0,4959,2,1994-01-05,80952,24,3373.0,A,2,1,POPLATEK MESICNE,...,0,1,1,100.0,12541,0.2,0.43,167,85677.0,99107
1,4961,19,1996-04-29,30276,12,2523.0,B,19,21,POPLATEK MESICNE,...,7,1,7,67.0,9104,1.5,2.07,123,2299.0,2354
2,4962,25,1997-12-08,30276,12,2523.0,A,25,68,POPLATEK MESICNE,...,18,2,6,57.2,9893,4.0,4.72,96,5623.0,5887
3,4967,37,1998-10-14,318480,60,5308.0,D,37,20,POPLATEK MESICNE,...,3,1,4,58.4,8547,2.6,3.64,120,1563.0,1542
4,4968,38,1998-04-19,110736,48,2307.0,C,38,19,POPLATEK TYDNE,...,3,1,4,52.7,8402,3.1,3.98,120,999.0,1099